core/app/Http/Controllers/Admin/CurrencyController.php

    public function index(Request $request)
    {
        $data['pageTitle'] = 'إدارة العملات';

        $search['name'] = $request->name;
        $search['code'] = $request->code;

        $data['currencies'] = Currency::when($search['name'], function ($q) use ($search) {
            $q->where('name', 'LIKE', '%' . $search['name'] . '%');
        })
            ->when($search['code'], function ($q) use ($search) {
                $q->where('code', 'LIKE', '%' . $search['code'] . '%');
            })
            ->latest()->paginate();
---
select * from `currencies` order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `currencies`

    public function add(Request $request)
    {
        $request->validate([
            'name' => 'required|string|max:255|unique:currencies,name',
            'code' => 'required|string|max:255|unique:currencies,code',
            'rate' => 'required|numeric',
            'image' => 'nullable|image|mimes:jpg,png,jpeg',
        ], [
            'name.required' => 'حقل الاسم مطلوب.',
            'name.string' => 'يجب أن يكون الاسم نصًا.',
            'name.max' => 'الاسم لا يجب أن يتجاوز 255 حرفًا.',
            'name.unique' => 'الاسم مُستخدم بالفعل.',
            'code.required' => 'حقل الكود مطلوب.',
            'code.string' => 'يجب أن يكون الكود نصًا.',
            'code.max' => 'الكود لا يجب أن يتجاوز 255 حرفًا.',
            'code.unique' => 'الكود مُستخدم بالفعل.',
            'rate.required' => 'حقل السعر مطلوب.',
            'rate.numeric' => 'يجب أن يكون السعر رقمًا.',
            'image.image' => 'يجب أن يكون الملف الصوري صورة.',
            'image.mimes' => 'يجب أن يكون الملف الصوري من النوع: jpg, png, jpeg.',
        ]);


        if ($request->hasFile('image')) {
            $filename = uploadImage($request->image, filePath('currency', true));
        }

        Currency::create([
            'name' => $request->name,
            'code' => $request->code,
            'rate' => $request->rate,
            'image' => $filename ?? '',
            'status' => isset($request->status) && $request->status == 'on' ? 1 : 0
        ]);
---
insert into `currencies` (`name`, `code`, `rate`, `image`, `status`, `updated_at`, `created_at`) values ('USD', 'USD', '1', '6581a77c6d6b21702995836.png', 0, '2023-12-19 16:23:56', '2023-12-19 16:23:56')