core/app/Http/Controllers/Admin/DirectPurchaseController.php

    public function index(Request $request)
    {
        $data['pageTitle'] = 'قائمة معاملات الشراء المباشر';
        $data['users'] = User::get();
        $data['funds'] = Fund::where('status', 1)->get();

        $search['utr'] = $request->utr;
        $search['item'] = $request->item;
        $search['date'] = $request->date;

        $data['purchases'] = DirectPurchase::when($search['utr'], function ($q) use ($search) {
            $q->where('utr', 'LIKE', '%' . $search['utr'] . '%');
        })
            ->when($search['item'], function ($q) use ($search) {
                $q->where('item_name', 'LIKE', '%' . $search['item'] . '%');
            })
            ->when($search['date'], function ($q) use ($search) {
                if (preg_match('/^\d{4}-\d{2}$/', $search['date'])) {
                    list($year, $month) = explode('-', $search['date']);
                    $q->whereYear('created_at', $year)->whereMonth('created_at', $month);
                } else {
                    $q->whereDate('created_at', $search['date']);
                }
            })
            ->latest()->paginate(10);
---
select * from `users`
select * from `funds` where `status` = 1
select * from `direct_purchases` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `direct_purchases`