core/app/Http/Controllers/Admin/FundVoucherController.php

select count(*) as count, sum(amount) as totalAmount, sum(charge) as totalProfits from `receipt_vouchers` limit 1
select currency_id, count(*) as count, sum(amount) as totalAmount from `receipt_vouchers` where year(`created_at`) = '2023' and month(`created_at`) = '12' group by `currency_id`
select count(*) as count, sum(amount) as totalAmount from `payment_vouchers` limit 1
select currency_id, count(*) as count, sum(amount) as totalAmount from `payment_vouchers` where year(`created_at`) = '2023' and month(`created_at`) = '12' group by `currency_id`
select * from `currencies` where `currencies`.`id` = 47 limit 1
---
    public function index(Request $request)
    {
        $data['pageTitle'] = 'صندوق السندات';

        $search['date'] = $request->date;
        $deposits = ReceiptVoucher::when($search['date'], function ($query) use ($search) {
            return $query->whereYear('created_at', '=', date('Y', strtotime($search['date'])))
                ->whereMonth('created_at', '=', date('m', strtotime($search['date'])));
        })->selectRaw('currency_id, count(*) as count, sum(amount) as totalAmount')
            ->groupBy('currency_id')
            ->get();

        $withdrawlas = PaymentVoucher::when($search['date'], function ($query) use ($search) {
            return $query->whereYear('created_at', '=', date('Y', strtotime($search['date'])))
                ->whereMonth('created_at', '=', date('m', strtotime($search['date'])));
        })->selectRaw('currency_id, count(*) as count, sum(amount) as totalAmount')
            ->groupBy('currency_id')
            ->get();

        $formattedResultsDeposits = [];
        foreach ($deposits as $deposit) {
            $currency = Currency::find($deposit->currency_id);

select * from `currencies` where `currencies`.`id` = 47 limit 1
---

        $formattedResultsWithdrawals = [];
        foreach ($withdrawlas as $withdraw) {
            $currency = Currency::find($withdraw->currency_id);