core/app/Http/Controllers/Admin/FundsController.php

select * from `funds` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `funds`
---
    public function index(Request $request)
    {
        $data['pageTitle'] = 'قائمة صناديق الشركة';

        $search['name'] = $request->name;
        $search['date'] = $request->date;
        $search['status'] = $request->status;

        $data['funds'] = Fund::when($search['name'], function ($q) use ($search) {
            $q->where('name', 'LIKE', '%' . $search['name'] . '%');
        })
            ->when($search['date'], function ($q) use ($search) {
                $q->whereDate('created_at', $search['date']);
            })
            ->when($search['status'], function ($q) use ($search) {
                $q->where('status', $search['status']);
            })
            ->latest()->paginate(10);
        return view('backend.funds.index', compact('search'))->with($data);

insert into `funds` (`name`, `status`, `min_amount`, `max_amount`, `updated_at`, `created_at`) values ('lolo', '1', '0', '', '2023-12-19 21:55:44', '2023-12-19 21:55:44')
---
    public function create(Request $request)
    {
        $request->validate([
            'name' => 'required|unique:funds,name|max:255|string',
            'status' => 'required|in:2,1'
        ], [
            'name.required' => 'حقل الاسم مطلوب.',
            'name.unique' => 'الاسم موجود بالفعل في السجلات.',
            'name.max' => 'يجب أن لا يتجاوز الاسم :max حرفًا.',
            'name.string' => 'يجب أن يكون الاسم نصًا.',
            'status.required' => 'حقل الحالة مطلوب.',
            'status.in' => 'قيمة الحالة يجب أن تكون إما 0 أو 1.'
        ]);
        Fund::create([
            'name' => $request->name,
            'status' => $request->status,
        ]);

update `funds` set `max_amount` = '10', `funds`.`updated_at` = '2023-12-19 21:58:35' where `id` = 15
---
    public function addBalance(Request $request, Fund $fund)
    {
        $request->validate([
            'amount' => 'required|numeric|min:0',
            'note' => 'nullable|string',
        ], [
            'amount.required' => 'حقل المبلغ مطلوب.',
            'amount.numeric' => 'يجب أن يكون المبلغ رقمًا.',
            'amount.min' => 'يجب أن يكون المبلغ على الأقل :min.',
            'note.string' => 'يجب أن تكون الملاحظة نصًا.',
        ]);

        $fund->balance += $request->amount;
        $fund->save();

insert into `funds_transactions` (`fund_id`, `type`, `amount`, `charge`, `note`, `utr`, `updated_at`, `created_at`) values (15, 'subtract balance', '5', 0, '', 2660195467, '2023-12-19 22:06:02', '2023-12-19 22:06:02')
---
    public function subtractBalance(Request $request, Fund $fund)
    {
        $request->validate([
            'amount' => 'required|numeric|min:0',
            'note' => 'nullable|string',
        ], [
            'amount.required' => 'حقل المبلغ مطلوب.',
            'amount.numeric' => 'يجب أن يكون المبلغ رقمًا.',
            'amount.min' => 'يجب أن يكون المبلغ على الأقل :min.',
            'note.string' => 'يجب أن تكون الملاحظة نصًا.',
        ]);
        $fund->balance -= $request->amount;
        $fund->save();

        $fund_transaction = FundsTransaction::create([
            'fund_id' => $fund->id,
            'type' => 'subtract balance',
            'amount' => $request->amount,
            'charge' => 0,
            'note' => $request->note ?? null,
            'utr' => mt_rand(1000000000, 9999999999),
        ]);

        $transaction = new SystemTransaction();
        $transaction->amount = $fund_transaction->amount;
        $transaction->charge = $fund_transaction->charge;
        $fund_transaction->transactional()->save($transaction);