core/app/Http/Controllers/Admin/HomeController.php

select count(*) as aggregate from `tickets`
select count(*) as aggregate from `transaction_reports`
select count(*) as aggregate from `funds`
select count(*) as aggregate from `users`
select count(*) as aggregate from `users` where `status` = 1
select count(*) as aggregate from `users` where `status` = 0
select count(*) as aggregate from `purchases`
select count(*) as aggregate from `sales`
select count(*) as aggregate from `external_transactions`
select count(*) as aggregate from `receipt_vouchers`
select count(*) as aggregate from `payment_vouchers`
select count(*) as aggregate from `transaction_with_currencies`
select count(*) as aggregate from `direct_purchases`
select count(*) as aggregate from `checks`
---
    public function dashboard(Request $request)
    {
        if ($request->search) {
            $searchValue = $request->search;
            if (preg_match('/^AC-\w+/', $searchValue)) {
                return redirect()->route('admin.user', ['account_number' => $searchValue]);
            } elseif (filter_var($searchValue, FILTER_VALIDATE_EMAIL)) {
                return redirect()->route('admin.user', ['email' => $searchValue]);
            } else {
                return redirect()->route('admin.transaction', ['utr' => $searchValue]);
            }
        }

        $data['pageTitle'] = 'لوحة التحكم';
        $data['navDashboardActiveClass'] = "active";
        $data['totalTickets'] = Ticket::count();
        $data['totalTransReports'] = TransactionReport::count();
        $data['totalFunds'] = Fund::count();
        $data['totalUser'] = User::count();
        $data['activeUser'] = User::where('status', 1)->count();
        $data['deActiveUser'] = User::where('status', 0)->count();
        $data['purchasesTransactions'] = Purchase::count();
        $data['salesTransactions'] = Sale::count();
        $data['externalTransactions'] = ExternalTransaction::count();
        $data['receiptVouchers'] = ReceiptVoucher::count();
        $data['paymentVouchers'] = PaymentVoucher::count();
        $data['transWithCurrencies'] = TransactionWithCurrency::count();
        $data['directPurchase'] = DirectPurchase::count();
        $data['checks'] = Check::count();