core/app/Http/Controllers/Admin/PaymentVoucherController.php

select * from `currencies` where `status` = 1
select * from `payment_vouchers` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `payment_vouchers`
---
    public function index(Request $request)
    {
        $data['pageTitle'] = 'قائمة سندات الصرف';
        $data['currencies'] = Currency::where('status', 1)->get();

        $search['receipt_number'] = $request->receipt_number;
        $search['customer_name'] = $request->customer_name;
        $search['date'] = $request->date;
        $search['type'] = $request->type;
        $search['currency_id'] = $request->currency_id;

        $data['payment_vouchers'] = PaymentVoucher::when($search['receipt_number'], function ($q) use ($search) {
            $q->where('receipt_num', 'LIKE', '%' . $search['receipt_number'] . '%');
        })
            ->when($search['customer_name'], function ($q) use ($search) {
                $q->where('customar_name', 'LIKE', '%' . $search['customer_name'] . '%');
            })
            ->when($search['date'], function ($q) use ($search) {
                if (preg_match('/^\d{4}-\d{2}$/', $search['date'])) {
                    list($year, $month) = explode('-', $search['date']);
                    $q->whereYear('created_at', $year)->whereMonth('created_at', $month);
                } else {
                    $q->whereDate('created_at', $search['date']);
                }
            })
            ->when($search['type'], function ($q) use ($search) {
                $q->where('receipt_type', $search['type']);
            })
            ->when($search['currency_id'], function ($q) use ($search) {
                $q->where('currency_id', $search['currency_id']);
            })
            ->latest()->paginate(10);

insert into `payment_vouchers` (`receipt_num`, `customar_name`, `currency_id`, `amount`, `amount_in_words`, `receipt_type`, `check_no`, `bank`, `exchange_for`, `note`, `updated_at`, `created_at`) values ('', 'احمد محمد', '47', '250', '250 جنية مصري', '1', '', '', 'لول', 'لولو', '2023-12-19 19:11:24', '2023-12-19 19:11:24')
update `payment_vouchers` set `receipt_num` = '00009', `payment_vouchers`.`updated_at` = '2023-12-19 19:11:24' where `id` = 9
---
            'note.string' => 'يجب أن تكون الملاحظة نصًا.',
        ]);

        $payment_voucher = PaymentVoucher::create([
            'receipt_num' => null,
            'customar_name' => $request->customar_name,
            'currency_id' => $request->currency_id,
            'amount' => $request->amount,
            'amount_in_words' => $request->amount_in_words,
            'receipt_type' => $request->receipt_type,
            'check_no' => $request->check_no,
            'bank' => $request->bank,
            'exchange_for' => $request->exchange_for,
            'note' => $request->note
        ]);

        $payment_voucher->update([
            'receipt_num' => generateVoucherNumber($payment_voucher->id)
        ]);

select * from `admins` limit 1
---
        $transaction->charge = 0;
        $payment_voucher->transactional()->save($transaction);

        $admin = Admin::first();

select * from `payment_vouchers` where `payment_vouchers`.`id` = '10' limit 1
---
    public function print($id)
    {
        $payment_voucher = PaymentVoucher::findOrFail($id);

select * from `payment_vouchers` where `payment_vouchers`.`id` = '9' limit 1
delete from `payment_vouchers` where `id` = 9
---
    public function delete($id)
    {
        $payment_voucher = PaymentVoucher::with('transactional')->findOrFail($id);
        if ($payment_voucher->transactional) {
            $payment_voucher->transactional->delete();
        }
        $payment_voucher->delete();