core/app/Http/Controllers/Admin/ProfitsController.php

select * from `expenses` where year(`created_at`) = 2023 and month(`created_at`) = '12'
select * from `currencies` where `currencies`.`id` in (47)
select * from `direct_purchases` where `direct_purchases`.`id` in (2, 5, 6)
select * from `external_transactions` where `external_transactions`.`id` in (1, 3)
select * from `funds` where `funds`.`id` in (13)
---
    public function profits(Request $request)
    {
        $data['pageTitle'] = 'الأرباح';
        $dateString = $request->input('date') ?? now()->format('Y-m');
        $date = Carbon::createFromFormat('Y-m', $dateString);

        $expenses = Expense::whereYear('created_at', $date->year)
            ->whereMonth('created_at', $date->month)
            ->get();

        $totalAmountOfExpenses = $expenses->sum('amount');
        $totalExpenses = $expenses->count();

        $transactions = SystemTransaction::with(['transactional' => function (MorphTo $morphTo) {
            $morphTo->morphWith([
                Purchase::class => ['buyer', 'seller'],
                Sale::class => ['fund', 'buyer'],
                ExternalTransaction::class,
                TransactionWithCurrency::class => ['currency'],
                DirectPurchase::class => ['seller', 'fund'],
            ]);
        }])
            ->whereHasMorph(
                'transactional',
                [
                    Purchase::class,
                    Sale::class,
                    ExternalTransaction::class,
                    TransactionWithCurrency::class,
                    DirectPurchase::class,
                ]
            )
            ->whereYear('created_at', $date->year)
            ->whereMonth('created_at', $date->month)
            ->get();