core/app/Http/Controllers/Admin/ReceiptVoucherController.php

select * from `currencies` where `status` = 1
select * from `receipt_vouchers` where `currency_id` = '47' order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `receipt_vouchers` where `currency_id` = '47'
---
    public function index(Request $request)
    {
        $data['pageTitle'] = 'قائمة سندات القبض';
        $data['currencies'] = Currency::where('status', 1)->get();
        $search['receipt_number'] = $request->receipt_number;
        $search['customer_name'] = $request->customer_name;
        $search['date'] = $request->date;
        $search['type'] = $request->type;
        $search['currency_id'] = $request->currency_id;

        $data['receipt_vouchers'] = ReceiptVoucher::when($search['receipt_number'], function ($q) use ($search) {
            $q->where('receipt_num', 'LIKE', '%' . $search['receipt_number'] . '%');
        })
            ->when($search['customer_name'], function ($q) use ($search) {
                $q->where('customar_name', 'LIKE', '%' . $search['customer_name'] . '%');
            })
            ->when($search['date'], function ($q) use ($search) {
                if (preg_match('/^\d{4}-\d{2}$/', $search['date'])) {
                    list($year, $month) = explode('-', $search['date']);
                    $q->whereYear('created_at', $year)->whereMonth('created_at', $month);
                } else {
                    $q->whereDate('created_at', $search['date']);
                }
            })
            ->when($search['type'], function ($q) use ($search) {
                $q->where('receipt_type', $search['type']);
            })
            ->when($search['currency_id'], function ($q) use ($search) {
                $q->where('currency_id', $search['currency_id']);
            })
            ->latest()->paginate(10);

insert into `receipt_vouchers` (`receipt_num`, `customar_name`, `currency_id`, `amount`, `charge`, `amount_in_words`, `receipt_type`, `check_no`, `bank`, `exchange_for`, `note`, `updated_at`, `created_at`) values ('', 'عيسي عيسي', '49', '1000', 0, 'خمس وعشرون دولار', '1', '', '', '', '', '2023-12-19 21:02:20', '2023-12-19 21:02:20')
update `receipt_vouchers` set `receipt_num` = '00008', `receipt_vouchers`.`updated_at` = '2023-12-19 21:02:20' where `id` = 8
---
            'note.string' => 'يجب أن تكون الملاحظة نصًا.',
        ]);

        $receipt_voucher = ReceiptVoucher::create([
            'receipt_num' => null,
            'customar_name' => $request->customar_name,
            'currency_id' => $request->currency_id,
            'amount' => $request->amount,
            'charge' => 0,
            'amount_in_words' => $request->amount_in_words,
            'receipt_type' => $request->receipt_type,
            'check_no' => $request->check_no ?? null,
            'bank' => $request->bank ?? null,
            'exchange_for' => $request->exchange_for,
            'note' => $request->note,
        ]);

        $receipt_voucher->update([
            'receipt_num' => generateVoucherNumber($receipt_voucher->id),
        ]);

select * from `admins` limit 1
---
        $transaction->charge = $receipt_voucher->charge;
        $receipt_voucher->transactional()->save($transaction);

        $admin = Admin::first();

select * from `receipt_vouchers` where `receipt_vouchers`.`id` = '1' limit 1
---
    public function print($id)
    {
        $receipt_voucher = ReceiptVoucher::findOrFail($id);

select * from `receipt_vouchers` where `receipt_vouchers`.`id` = '1' limit 1
---
            'note.string' => 'يجب أن تكون الملاحظة نصًا.',
        ]);

        $receipt_voucher = ReceiptVoucher::with('transactional')->findOrFail($id);

select * from `receipt_vouchers` where `receipt_vouchers`.`id` = '3' limit 1
delete from `receipt_vouchers` where `id` = 3
---
    public function delete($id)
    {
        $receipt_voucher = ReceiptVoucher::with('transactional')->findOrFail($id);
        if ($receipt_voucher->transactional) {
            $receipt_voucher->transactional->delete();
        }
        $receipt_voucher->delete();