core/app/Http/Controllers/Admin/SaleController.php

select * from `funds` where `status` = 1
select * from `users`
select * from `sales` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `sales`
---
    public function index(Request $request)
    {
        $data['pageTitle'] = 'قائمة معاملات البيع';
        $data['funds'] = Fund::where('status', 1)->get(); // active funds
        $data['users'] = User::get();

        $search['utr'] = $request->utr;
        $search['item_name'] = $request->item_name;
        $search['date'] = $request->date;
        $search['fund_id'] = $request->fund_id;

        $data['sales'] = Sale::when($search['utr'], function ($q) use ($search) {
            $q->where('utr', 'LIKE', '%' . $search['utr'] . '%');
        })
            ->when($search['item_name'], function ($q) use ($search) {
                $q->where('item_name', 'LIKE', '%' . $search['item_name'] . '%');
            })
            ->when($search['fund_id'], function ($q) use ($search) {
                $q->where('fund_id', $search['fund_id']);
            })
            ->when($search['date'], function ($q) use ($search) {
                if (preg_match('/^\d{4}-\d{2}$/', $search['date'])) {
                    list($year, $month) = explode('-', $search['date']);
                    $q->whereYear('created_at', $year)->whereMonth('created_at', $month);
                } else {
                    $q->whereDate('created_at', $search['date']);
                }
            })
            ->latest()->paginate(10);

select * from `users` where `account_number` = 'AC-0001-99' limit 1
---
    public function create(Request $request)
    {
        $request->validate([
            'item_name' => 'required|string|max:255',
            'buyer_account_number' => 'required|string',
            'fund_id' => 'required|numeric|not_in:0',
            'amount' => 'required|numeric',
            'sale_cost' => 'required|numeric',
            'note' => 'nullable|string'
        ], [
            'item_name.required' => 'حقل اسم العنصر مطلوب.',
            'item_name.string' => 'يجب أن يكون اسم العنصر نصًا.',
            'item_name.max' => 'يجب ألا يتجاوز اسم العنصر :max حرفًا.',
            'buyer_account_number.required' => 'حقل رقم حساب المشتري مطلوب.',
            'buyer_account_number.string' => 'يجب أن يكون رقم حساب المشتري نصًا.',
            'fund_id.required' => 'حقل رقم الصندوق مطلوب.',
            'fund_id.numeric' => 'يجب أن يكون رقم الصندوق رقمًا.',
            'fund_id.not_in' => 'يجب تحديد قيمة غير صفر لرقم الصندوق.',
            'amount.required' => 'حقل المبلغ مطلوب.',
            'amount.numeric' => 'يجب أن يكون المبلغ رقمًا.',
            'sale_cost.required' => 'حقل تكلفة البيع مطلوب.',
            'sale_cost.numeric' => 'يجب أن تكون تكلفة البيع رقمًا.',
            'note.string' => 'يجب أن تكون الملاحظة نصًا.',
        ]);

        $buyer = User::where('account_number', $request->buyer_account_number)
            ->first();

select * from `funds` where `funds`.`id` = '15' limit 1
update `funds` set `balance` = 0, `funds`.`updated_at` = '2023-12-19 22:15:48' where `id` = 15
---
            return redirect()->back()->withNotify($notify);
        }

        $fund = Fund::findOrFail($request->fund_id);

        $fund->balance -= $request->amount;
        $fund->save();

insert into `sales` (`item_name`, `fund_id`, `buyer_id`, `amount`, `sales_cost`, `fund_floating_balance`, `buyer_floating_balance`, `charge`, `note`, `utr`, `updated_at`, `created_at`) values ('sdkcdsjn', 15, 1, '5', '5', 0, -75, 0, '', 9951753544, '2023-12-19 22:15:48', '2023-12-19 22:15:48')
---

        $charge = $request->sale_cost - $request->amount;

        $sale = Sale::create([
            'item_name' => $request->item_name,
            'fund_id' => $fund->id,
            'buyer_id' => $buyer->id,
            'amount' => $request->amount,
            'sales_cost' => $request->sale_cost,
            'fund_floating_balance' => $fund->balance,
            'buyer_floating_balance' => $buyer->balance,
            'charge' => $charge,
            'note' => $request->note ?? null,
            'utr' => mt_rand(1000000000, 9999999999),
        ]);

select * from `admins` limit 1
---
        $transaction->charge = $sale->charge;
        $sale->transactional()->save($transaction);

        $admin = Admin::first();