core/app/Http/Controllers/Admin/TransactionReportsController.php

    public function index(Request $request)
    {
        $data['pageTitle'] = "قائمة بلاغات المعاملات";

        $search['utr'] = $request->utr;
        $search['transaction_utr'] = $request->transaction_utr;
        $search['status'] = $request->status;
        $search['date'] = $request->date;

        $data['reports'] = TransactionReport::with('user')
            ->when($search['utr'], function ($item) use ($search) {
                $item->where('utr', 'LIKE', '%' . $search['utr'] . '%');
            })
            ->when($search['transaction_utr'], function ($item) use ($search) {
                $item->where('transaction_utr', 'LIKE', '%' . $search['transaction_utr'] . '%');
            })
            ->when($search['status'], function ($item) use ($search) {
                $item->where('replied', $search['status']);
            })
            ->when($search['date'], function ($item) use ($search) {
                $item->whereDate('created_at', $search['date']);
            })
            ->latest()->paginate();
---
select * from `transaction_reports` order by `created_at` desc limit 15 offset 0
select * from `users` where `users`.`id` in (1, 2)
select count(*) as aggregate from `transaction_reports`