core/app/Http/Controllers/Admin/TransactionsWithCurrencyController.php

select * from `currencies`
select * from `transaction_with_currencies` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `transaction_with_currencies`
---
    public function index(Request $request)
    {
        $data['pageTitle'] = 'قائمة المعاملات بعملات متعددة';

        $search['utr'] = $request->utr;
        $search['trans_type'] = $request->trans_type;
        $search['currency_id'] = $request->currency_id;
        $search['date'] = $request->date;

        $data['currencies'] = Currency::get();
        $data['transactions'] = TransactionWithCurrency::when($search['utr'], function ($q) use ($search) {
            $q->where('utr', 'LIKE', '%' . $search['utr'] . '%');
        })
            ->when($search['trans_type'], function ($q) use ($search) {
                $q->where('trans_type', $search['trans_type']);
            })
            ->when($search['currency_id'], function ($q) use ($search) {
                $q->where('currency_id', $search['currency_id']);
            })
            ->when($search['date'], function ($q) use ($search) {
                if (preg_match('/^\d{4}-\d{2}$/', $search['date'])) {
                    list($year, $month) = explode('-', $search['date']);
                    $q->whereYear('created_at', $year)->whereMonth('created_at', $month);
                } else {
                    $q->whereDate('created_at', $search['date']);
                }
            })
            ->latest()->paginate(10);