core/app/Http/Helpers/helpers.php

select * from `general_settings` limit 1
---
function filePath($folder_name, $default = false)
{
    $general = GeneralSetting::first();

select * from `general_settings` limit 1
---
function getFile($folder_name, $filename, $default = false)
{
    $general = GeneralSetting::first();