core/app/Notifications/PaymentVoucherNotification.php

    public function __construct($voucher)
    {
        $this->voucher = $voucher;
        $this->general = GeneralSetting::first();
---
select * from `general_settings` limit 1