core/app/Notifications/ReceiptVoucherNotification.php

select * from `general_settings` limit 1
---
    public function __construct($voucher)
    {
        $this->voucher = $voucher;
        $this->general = GeneralSetting::first();