core/app/Notifications/SaleBuyerNotification.php

select * from `general_settings` limit 1
---
    public function __construct($sale)
    {
        $this->sale = $sale;
        $this->general = GeneralSetting::first();