core/app/Providers/AppServiceProvider.php

    public function boot()
    {
        $general = GeneralSetting::first();

        setlocale(LC_TIME, App::currentLocale());

        View::composer('backend.layout.sidebar', function ($view) {
            $numOfPendingTickets = Ticket::where('status', 2)->count();
            $view->with('numOfPendingTickets',  $numOfPendingTickets);
        });

        View::composer('backend.layout.navbar', function ($view) {
            $notifications = auth()->guard('admin')->user()->unreadNotifications;
            $view->with('notifications',  $notifications);
        });

        View::composer('backend.layout.sidebar', function ($view) {
            $pendingReports = TransactionReport::where('replied', 0)->count();
---
select count(*) as aggregate from `tickets` where `status` = 2
select count(*) as aggregate from `transaction_reports` where `replied` = 0